experiments/results/fio-rand/10-exfat-fuse-randread-2.txt
/mnt/test_file: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 2 processes

/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=224271: Sat Aug 23 13:43:38 2025
  read: IOPS=10.3k, BW=40.2MiB/s (42.1MB/s)(402MiB/10001msec)
    clat (usec): min=12, max=8466, avg=96.81, stdev=28.01
     lat (usec): min=12, max=8467, avg=96.85, stdev=28.01
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   93], 10.00th=[   94], 20.00th=[   94],
     | 30.00th=[   95], 40.00th=[   96], 50.00th=[   96], 60.00th=[   97],
     | 70.00th=[   97], 80.00th=[   98], 90.00th=[  100], 95.00th=[  112],
     | 99.00th=[  131], 99.50th=[  135], 99.90th=[  155], 99.95th=[  163],
     | 99.99th=[  239]
   bw (  KiB/s): min=40656, max=41472, per=50.01%, avg=41136.84, stdev=192.63, samples=19
   iops        : min=10164, max=10368, avg=10284.21, stdev=48.16, samples=19
  lat (usec)   : 20=0.02%, 50=0.01%, 100=90.01%, 250=9.95%, 500=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=1.14%, sys=5.61%, ctx=102827, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=102824,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=224272: Sat Aug 23 13:43:38 2025
  read: IOPS=10.3k, BW=40.2MiB/s (42.1MB/s)(402MiB/10001msec)
    clat (usec): min=13, max=8539, avg=96.81, stdev=28.24
     lat (usec): min=13, max=8539, avg=96.85, stdev=28.24
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   93], 10.00th=[   94], 20.00th=[   94],
     | 30.00th=[   95], 40.00th=[   96], 50.00th=[   96], 60.00th=[   97],
     | 70.00th=[   97], 80.00th=[   98], 90.00th=[  100], 95.00th=[  112],
     | 99.00th=[  131], 99.50th=[  135], 99.90th=[  155], 99.95th=[  165],
     | 99.99th=[  237]
   bw (  KiB/s): min=40608, max=41480, per=50.01%, avg=41134.74, stdev=200.40, samples=19
   iops        : min=10152, max=10370, avg=10283.68, stdev=50.10, samples=19
  lat (usec)   : 20=0.03%, 50=0.01%, 100=89.94%, 250=10.01%, 500=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=1.12%, sys=5.60%, ctx=102821, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=102818,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=80.3MiB/s (84.2MB/s), 40.2MiB/s-40.2MiB/s (42.1MB/s-42.1MB/s), io=803MiB (842MB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=203320/0, merge=0/0, ticks=8240/0, in_queue=8240, util=99.06%